app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    @product.user_id = current_user.id
    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`code`, `created_at`, `name`, `price`, `updated_at`, `user_id`) VALUES ('RGQQ62', '2014-10-09 05:34:23', 'Coca', 3500, '2014-10-09 05:34:23', 1)

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE `products` SET `price` = 6500, `updated_at` = '2014-10-09 09:44:57' WHERE `products`.`id` = 1