app/controllers/sales_controller.rb

  def index
    @sales = Sale.all
---
SELECT `sales`.* FROM `sales`

  def create
    @sale = Sale.new(sale_params)
    @sale.user_id = current_user.id #tambahkan ini setelah code di atas
    @sale.total = @sale.total_all #tambahkan ini setelah code di atas
    respond_to do |format|
      if @sale.save
---
INSERT INTO `sales` (`created_at`, `name`, `total`, `updated_at`, `user_id`) VALUES ('2014-10-09 07:48:42', 'Senin', 97000, '2014-10-09 07:48:42', 1)

  def destroy
    @sale.destroy
---
DELETE FROM `sales` WHERE `sales`.`id` = 1

  def set_sale
    @sale = Sale.find(params[:id])
---
SELECT  `sales`.* FROM `sales`  WHERE `sales`.`id` = 3 LIMIT 1