app/views/sales/show.html.erb

SELECT `items`.* FROM `items`  WHERE `items`.`sale_id` = 2
---
  <tbody>
  <% @sale.items.each do |item| %>